In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
city_df = pd.read_csv("Resources/city_data.csv")
ride_df = pd.read_csv("Resources/ride_data.csv")
ride_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [8]:
# Get all the rows that contain null values
city_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [11]:
# alt way
city_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [9]:
# Make sure the driver_count column has an integer data type
city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [15]:
# Find out how many data points there are for each type of city
city_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [18]:
# Get the number of data points from the Urban cities.
sum(city_df["type"]=="Suburban")

36

In [19]:
# Get all the rows that contain null values.
ride_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [20]:
ride_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [21]:
# Make sure the fare and ride_id columns are numerical data types
ride_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [23]:
# merge dfs
# For merging data frames: inner merge is default unless otherwise specified
pyber_df = pd.merge(ride_df,city_df,on=["city","city"],how="left")
pyber_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban